In [1]:
# import libraries
import numpy as np
import pandas as pd
import keras
import tensorflow

In [2]:
# load dataset
#train = pd.read_csv('train-data.csv')
#test = pd.read_csv('test-data.csv')

In [3]:
#train.head()

In [4]:
#test.head()

In [5]:
#train.isna().sum()

In [6]:
from sklearn.model_selection import train_test_split
train=pd.read_csv("train-data.csv")
indices=range(len(train))
train_indices, test_indices = train_test_split(indices, test_size=0.2, random_state=42)

In [7]:
test=train.loc[test_indices]
train=train.loc[train_indices]

In [8]:
train.drop(columns=["Unnamed: 0","Location","New_Price"],axis=1,inplace=True)
test.drop(columns=["Unnamed: 0","Location","New_Price"],axis=1,inplace=True)

In [9]:
train.dropna(subset=["Engine","Power","Seats","Mileage"],axis=0,inplace=True)
test.dropna(subset=["Engine","Power","Seats","Mileage"],axis=0,inplace=True)

In [10]:
train.isna().sum()

Name                 0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
Price                0
dtype: int64

In [11]:
train.head(5)

,Name,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
4248,Chevrolet Beat LS,2011,76155,Petrol,Manual,First,18.6 kmpl,1199 CC,79.4 bhp,5.0,1.95
4129,Ford EcoSport 1.5 TDCi Titanium,2014,64637,Diesel,Manual,First,22.77 kmpl,1498 CC,98.59 bhp,5.0,7.52
2534,Maruti Vitara Brezza ZDi,2018,2900,Diesel,Manual,First,24.3 kmpl,1248 CC,88.5 bhp,5.0,8.75
2893,Toyota Innova 2.5 VX (Diesel) 8 Seater,2011,150000,Diesel,Manual,First,12.99 kmpl,2494 CC,100.6 bhp,8.0,6.95
2860,Tata Bolt Quadrajet XM,2017,98500,Diesel,Manual,First,22.95 kmpl,1248 CC,74 bhp,5.0,6.00

In [12]:
test.head(5)

,Name,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
2868,Maruti Swift Dzire VDI,2013,69000,Diesel,Manual,First,23.4 kmpl,1248 CC,74 bhp,5.0,5.75
5924,Mahindra Scorpio 1.99 S4 Plus,2017,26741,Diesel,Manual,First,15.4 kmpl,1997 CC,120 bhp,7.0,10.08
3764,Mahindra XUV500 W8 2WD,2014,86000,Diesel,Manual,First,15.1 kmpl,2179 CC,140 bhp,7.0,7.85
4144,Tata Indigo CS eVX,2016,52000,Diesel,Manual,Second,25.0 kmpl,1396 CC,69.01 bhp,5.0,2.40
1514,Honda Accord 2.4 AT,2008,125000,Petrol,Automatic,Third,11.7 kmpl,2354 CC,177.6 bhp,5.0,2.60

In [13]:
train["Name"]=train["Name"].str.split().str[0]
test["Name"]=test["Name"].str.split().str[0]

In [14]:
fuels=train.groupby(["Fuel_Type"])["Price"].mean().sort_values(ascending=True).reset_index()["Fuel_Type"]

fuels={value:index for index,value in enumerate(fuels)}
fuels
train["Fuel_Type"]=train["Fuel_Type"].replace(fuels)
test["Fuel_Type"]=test["Fuel_Type"].replace(fuels)

In [15]:
train["Transmission"]=train["Transmission"].replace({"Manual":1,"Automatic":0})
test["Transmission"]=test["Transmission"].replace({"Manual":1,"Automatic":0})
modelss=train.groupby(["Name"])["Price"].mean().sort_values(ascending=True).reset_index()["Name"]

modelss={value:index for index,value in enumerate(modelss)}

In [16]:
train["Name"]=train["Name"].replace(modelss)
test["Name"]=test["Name"].replace(modelss)

In [17]:
train["Owner_Type"].value_counts()

First             3928
Second             751
Third               94
Fourth & Above       6
Name: Owner_Type, dtype: int64

In [18]:
train["Owner_Type"]=train["Owner_Type"].replace({"First":1,"Second":2,"Third":3,"Fourth & Above":4})
test["Owner_Type"]=test["Owner_Type"].replace({"First":1,"Second":2,"Third":3,"Fourth & Above":4})

In [19]:
train["Power"]=pd.to_numeric(train["Power"],errors="coerce")
test["Power"]=pd.to_numeric(test["Power"],errors="coerce")

In [20]:
train["new"]=train.Mileage.str.split().str[0].astype(float)
test["new"]=test.Mileage.str.split().str[0].astype(float)

train.drop(columns=["new","Mileage"],axis=1,inplace=True)
test.drop(columns=["new","Mileage"],axis=1,inplace=True)

In [21]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4779 entries, 4248 to 860
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               4779 non-null   int64
 1   Year               4779 non-null   int64
 2   Kilometers_Driven  4779 non-null   int64
 3   Fuel_Type          4779 non-null   int64
 4   Transmission       4779 non-null   int64
 5   Owner_Type         4779 non-null   int64
 6   Engine             4779 non-null   object
 7   Power              0 non-null      float64
 8   Seats              4779 non-null   float64
 9   Price              4779 non-null   float64
dtypes: float64(3), int64(6), object(1)
memory usage: 410.7+ KB

In [22]:
train['numberEngine']=train['Engine'].str.split().str[0]
test['numberEngine']=test['Engine'].str.split().str[0]

In [23]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4779 entries, 4248 to 860
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               4779 non-null   int64
 1   Year               4779 non-null   int64
 2   Kilometers_Driven  4779 non-null   int64
 3   Fuel_Type          4779 non-null   int64
 4   Transmission       4779 non-null   int64
 5   Owner_Type         4779 non-null   int64
 6   Engine             4779 non-null   object
 7   Power              0 non-null      float64
 8   Seats              4779 non-null   float64
 9   Price              4779 non-null   float64
 10  numberEngine       4779 non-null   object
dtypes: float64(3), int64(6), object(2)
memory usage: 448.0+ KB

In [24]:
train['numberEngine']=train['numberEngine'].astype(int)
test['numberEngine']=test['numberEngine'].astype(int)

In [25]:
train.corr()['numberEngine'].sort_values(ascending=False)

numberEngine         1.000000
Name                 0.722999
Price                0.657860
Fuel_Type            0.420717
Seats                0.390192
Kilometers_Driven    0.155547
Owner_Type           0.048983
Year                -0.055723
Transmission        -0.506939
Power                     NaN
Name: numberEngine, dtype: float64

In [26]:
train.drop(columns=['Engine'],inplace=True)
test.drop(columns=['Engine'],inplace=True)

In [27]:
train=train.rename(columns={"numberEngine":"Engine"})
test=test.rename(columns={"numberEngine":"Engine"})

In [28]:
train.drop(columns=["Power"],inplace=True)
test.drop(columns=["Power"],inplace=True)

In [29]:
train.head()

,Name,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Seats,Price,Engine
4248,0,2011,76155,2,1,1,5.0,1.95,1199
4129,10,2014,64637,3,1,1,5.0,7.52,1498
2534,4,2018,2900,3,1,1,5.0,8.75,1248
2893,15,2011,150000,3,1,1,8.0,6.95,2494
2860,2,2017,98500,3,1,1,5.0,6.00,1248

In [30]:
test.head()

,Name,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Seats,Price,Engine
2868,4,2013,69000,3,1,1,5.0,5.75,1248
5924,12,2017,26741,3,1,1,7.0,10.08,1997
3764,12,2014,86000,3,1,1,7.0,7.85,2179
4144,2,2016,52000,3,1,2,5.0,2.40,1396
1514,8,2008,125000,2,0,3,5.0,2.60,2354

In [31]:
y_train=train['Price']
train.drop(columns=["Price"],inplace=True)

In [32]:
y_test=test["Price"].copy()
test.drop(columns=["Price"],inplace=True)

In [33]:
from tensorflow.keras.models import Sequential      
from tensorflow.keras.layers import Dense

In [34]:
model = Sequential()
model.add(Dense(64, input_dim = 8, activation='relu'))

model.add(Dense(32, activation='relu'))

model.add(Dense(32, activation='relu'))
model.add(Dense(1, activation='relu'))
model.summary()

Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #
=================================================================
 dense (Dense)               (None, 64)                576

 dense_1 (Dense)             (None, 32)                2080

 dense_2 (Dense)             (None, 32)                1056

 dense_3 (Dense)             (None, 1)                 33

=================================================================
Total params: 3,745
Trainable params: 3,745
Non-trainable params: 0
_________________________________________________________________

In [35]:
model.compile(optimizer='adagrad', loss='mean_absolute_error',metrics='accuracy')

In [36]:
y_train.shape

(4779,)

In [37]:
test.shape

(1196, 8)

In [ ]:
history = model.fit(train, y_train, epochs=100, 
                    batch_size=128,  
                    verbose=1, 
                    validation_split=0.10)

Epoch 1/100
34/34 [==============================] - 1s 11ms/step - loss: 97.6448 - accuracy: 4.6501e-04 - val_loss: 10.2297 - val_accuracy: 0.0000e+00
Epoch 2/100
34/34 [==============================] - 0s 3ms/step - loss: 10.5352 - accuracy: 2.3250e-04 - val_loss: 9.7126 - val_accuracy: 0.0000e+00
Epoch 3/100
28/34 [=======================>......] - ETA: 0s - loss: 10.0225 - accuracy: 0.0000e+00